r1mikey/illumos-gate/usr/src/man/man9f/pcc_chan.9f
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\" Copyright 2026 Michael van der Westhuizen
.\"
.Dd September 21, 2026
.Dt PCC_CHAN 9F
.Os
.Sh NAME
.Nm pcc_chan_get ,
.Nm pcc_chan_put ,
.Nm pcc_chan_lock ,
.Nm pcc_chan_unlock ,
.Nm pcc_chan_read32 ,
.Nm pcc_chan_write32 ,
.Nm pcc_chan_read64 ,
.Nm pcc_chan_write64 ,
.Nm pcc_chan_send
.Nd PCC channel operations
.Sh SYNOPSIS
.In sys/acpipcc.h
.Ft "pcc_chan_t *"
.Fn pcc_chan_get "uint_t chan_id"
.Ft void
.Fn pcc_chan_put "pcc_chan_t *pc"
.Ft void
.Fn pcc_chan_lock "pcc_chan_t *pc"
.Ft void
.Fn pcc_chan_unlock "pcc_chan_t *pc"
.Ft int
.Fn pcc_chan_read32 "pcc_chan_t *pc" "uint32_t offset" "uint32_t *val"
.Ft int
.Fn pcc_chan_write32 "pcc_chan_t *pc" "uint32_t offset" "uint32_t val"
.Ft int
.Fn pcc_chan_read64 "pcc_chan_t *pc" "uint32_t offset" "uint64_t *val"
.Ft int
.Fn pcc_chan_write64 "pcc_chan_t *pc" "uint32_t offset" "uint64_t val"
.Ft int
.Fn pcc_chan_send "pcc_chan_t *pc" "uint32_t cmd" "uint32_t payload_len"
.Sh INTERFACE LEVEL
illumos architecture specific.
.Sh PARAMETERS
.Bl -tag -width Ds
.It Fa pc
A channel handle obtained from
.Fn pcc_chan_get .
.It Fa chan_id
The firmware subspace ID.
This value is commonly obtained from firmware, such
as the identifier yielded by a CPPC
.Dv _CPC
package.
.It Fa offset
Byte offset into the channel's Communication Space, the payload area
following the type-specific shared memory header.
.It Fa val
For the read accessors, a pointer to where the value is stored; for
the write accessors, the value to write.
.It Fa cmd
The command code to send.
.It Fa payload_len
The number of payload bytes the caller staged with the
.Fn pcc_chan_write32
and
.Fn pcc_chan_write64
functions, or 0 for a header-only command.
.El
.Sh DESCRIPTION
The
.Nm pcc_chan
functions operate on PCC channels published by the
.Xr acpipcc 4D
module.
.Pp
.Fn pcc_chan_get
looks up the channel for firmware subspace
.Fa chan_id .
It returns a channel handle, or
.Dv NULL
if the subspace does not exist, is unusable, or PCC did not
initialise.
A successful call increments the channel's reference count and must
be paired with
.Fn pcc_chan_put .
.Pp
.Fn pcc_chan_put
releases a handle obtained from
.Fn pcc_chan_get ,
decrementing the channel's reference count.
The caller must not hold the channel mutex.
.Pp
.Fn pcc_chan_lock
and
.Fn pcc_chan_unlock
acquire and release the channel mutex.
The mutex serialises whole transactions on the channel: it is held
across payload writes, the doorbell, the completion wait, and result
reads.
.Pp
.Fn pcc_chan_read32 ,
.Fn pcc_chan_write32 ,
.Fn pcc_chan_read64
and
.Fn pcc_chan_write64
read or write the channel's Communication Space.
.Fa offset
is relative to the start of the Communication Space.
The caller must hold the channel mutex.
.Pp
.Fn pcc_chan_send
sends a command on the channel: it writes the shared memory header,
rings the doorbell, and waits for completion (interrupt-driven when
the channel has a platform interrupt, polled otherwise).
The caller first stages the payload with the
.Fn pcc_chan_write32
and
.Fn pcc_chan_write64
functions.
The caller must hold the channel mutex.
.Sh CONTEXT
.Fn pcc_chan_get ,
.Fn pcc_chan_put ,
.Fn pcc_chan_lock ,
.Fn pcc_chan_unlock ,
the payload accessors and
.Fn pcc_chan_send
can be called from kernel context.
The caller must not hold the channel mutex across
.Fn pcc_chan_put ,
and must hold it across the payload accessors and
.Fn pcc_chan_send .
.Sh RETURN VALUES
.Fn pcc_chan_get
returns a channel handle, or
.Dv NULL
if the subspace does not exist, is unusable, or PCC did not
initialise.
.Pp
The
.Fn pcc_chan_read32 ,
.Fn pcc_chan_write32 ,
.Fn pcc_chan_read64
and
.Fn pcc_chan_write64
functions return
.Dv DDI_SUCCESS ,
or
.Dv DDI_FAILURE
if the access is out of bounds.
.Pp
.Fn pcc_chan_send
returns
.Dv DDI_SUCCESS ,
or
.Dv DDI_FAILURE
on transport or protocol errors.
.Sh SEE ALSO
.Xr acpipcc 4D
